w4d2/app/views/cat_cuddle_requests/_form.html.erb

SELECT "cats".* FROM "cats"
---
      <option disabled <%= cat_cuddle_request.cat_id ? "" : "selected" %>>-- Please Select --</option>
      <% Cat.all.each do |cat| %>