w4d2/app/views/cat_cuddle_requests/index.html.erb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 14]]
---
  <% @cat_cuddle_requests.each do |request| %>
    <li><h3> Requested cat: <%= Cat.find(request.cat_id).name %> </h3></li>