w4d2/app/views/cat_cuddle_requests/show.html.erb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 14]]
---
  <tr bgcolor= "#aec6cf">
    <th colspan="2"><%= @cat_cuddle_request.status %> REQUEST FOR <%= Cat.find(@cat_cuddle_request.cat_id).name.upcase %></th>