w4d2/app/controllers/cat_cuddle_requests_controller.rb

  def index
    if params[:cat_id]
      @cat_cuddle_requests = CatCuddleRequest.where(cat_id: params[:cat_id])
    else
      @cat_cuddle_requests = CatCuddleRequest.all
---
SELECT  "cat_cuddle_requests".* FROM "cat_cuddle_requests" WHERE "cat_cuddle_requests"."cat_id" = $1 LIMIT 1  [["cat_id", 17]]
SELECT "cat_cuddle_requests".* FROM "cat_cuddle_requests"

  def show
    @cat_cuddle_request = CatCuddleRequest.find(params[:id])
---
SELECT  "cat_cuddle_requests".* FROM "cat_cuddle_requests" WHERE "cat_cuddle_requests"."id" = $1 LIMIT 1  [["id", 13]]

  def edit
    @cat_cuddle_request = CatCuddleRequest.find_by(id: params[:id])
---
SELECT  "cat_cuddle_requests".* FROM "cat_cuddle_requests" WHERE "cat_cuddle_requests"."id" = $1 LIMIT 1  [["id", 20]]

  def create
    @cat_cuddle_request = CatCuddleRequest.new(cat_cuddle_request_params)
    if @cat_cuddle_request.save
---
INSERT INTO "cat_cuddle_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 0], ["start_date", "2017-02-24"], ["end_date", "2017-02-28"], ["created_at", "2017-02-15 01:54:00.395976"], ["updated_at", "2017-02-15 01:54:00.395976"]]

  def update
    @cat_cuddle_request = CatCuddleRequest.find_by(id: params[:id])
    if @cat_cuddle_request.update(cat_cuddle_request_params)
---
SELECT  "cat_cuddle_requests".* FROM "cat_cuddle_requests" WHERE "cat_cuddle_requests"."id" = $1 LIMIT 1  [["id", 20]]
UPDATE "cat_cuddle_requests" SET "cat_id" = $1, "start_date" = $2, "end_date" = $3, "updated_at" = $4 WHERE "cat_cuddle_requests"."id" = $5  [["cat_id", 0], ["start_date", "2017-03-15"], ["end_date", "2017-03-17"], ["updated_at", "2017-02-15 01:47:49.779995"], ["id", 23]]