w4d2/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "birth_date", "sex", "color", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 18]]
UPDATE "cats" SET "name" = $1, "color" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "Fly"], ["color", "black"], ["description", "I fly"], ["updated_at", "2017-02-15 00:24:34.932217"], ["id", 18]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)