W4D5/RedditClone/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (1)
---
  def index
    @posts = Post.all