GoalSetter/app/views/users/show.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 1]]
---
<ul>
  <%@user.goals.each do |goal| %>