w7d2/TodoApp/app/controllers/api/todos_controller.rb

  def show
    @todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def index
    @todos = Todo.all
---
SELECT "todos".* FROM "todos"

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ajax"], ["body", "request"], ["done", false], ["created_at", 2017-03-07 22:37:19 UTC], ["updated_at", 2017-03-07 22:37:19 UTC]]